"app.title" = "Mac System Info";
"cpu.title" = "CPU";
"cpu.usage" = "Usage: %.1f%%";
"cpu.cores" = "Core Usages";

"ram.title" = "Memory";
"ram.usage" = "%.1f%% Used";

"disk.title" = "Disk";
"disk.usage" = "%.1f%% Used";

"network.title" = "Network";

"info.title" = "General Information";
"info.host" = "Computer Name";
"info.model" = "Model";
"info.os" = "Operating System";
"info.processor" = "Processor";
"info.ramTotal" = "Total Memory";
"info.diskTotal" = "Total Space";
"info.localIP" = "Local IP";
"info.publicIP" = "Public IP";
"info.temp" = "Temperature Status";

"button.settings" = "Settings";
"button.quit" = "Quit App";
"button.save" = "Save Changes";
"button.close" = "Close";
"button.help" = "User Guide";
"button.report" = "Create Report";
"button.contact" = "Contact Us";
"button.showWindow" = "Window Mode";
"report.title" = "System Report";
"report.subtitle" = "Summary of hardware and software details";
"report.hardware" = "Hardware Specifications";
"report.network" = "Network Information";
"report.status" = "Current Status";
"report.copy" = "Copy Report";
"report.print" = "Print";
"report.date" = "Report Date";

"settings.title" = "Settings";
"settings.general" = "General";
"settings.advanced" = "Advanced";

"settings.view.title" = "Appearance";
"settings.view.showWindow" = "Show as a Window";
"settings.view.showCores" = "Show Core Usage";
"settings.view.showNetwork" = "Show Network Card";
"settings.view.showDisk" = "Show Disk Card";

"settings.monitor.title" = "System Monitor";
"settings.monitor.toggle" = "Stop / Start Monitoring";
"settings.monitor.energyMode" = "Energy Saving Mode";
"settings.monitor.refreshTime" = "Refresh Rate: %.1f s";
"settings.monitor.reset" = "Reset CPU & Network History";

"settings.theme.title" = "Appearance Theme";
"settings.theme.label" = "Theme";
"settings.theme.auto" = "System";
"settings.theme.light" = "Light";
"settings.theme.dark" = "Dark";
"menu.startup.title" = "Startup";
"menu.startup.enable" = "Launch at Login";
"menu.startup.disable" = "Disable Launch at Login";

"temp.normal" = "Normal 🌡";
"temp.warm" = "Warm";
"temp.hot" = "Hot 🔥";
"temp.critical" = "Critical 🚨";
"temp.unknown" = "Unknown";
"ip.loading" = "Loading...";
"ip.notFound" = "Not Found";
"unknown" = "Unknown";

"settings.language.title" = "Language";
"settings.language.system" = "System Default";
"settings.language.restart" = "Please restart the app for language changes to take effect.";

"help.title" = "Help";
"help.subtitle" = "Sistem Bilgi – Features and usage guide";
"help.version" = "Sistem Bilgi – Version 1.1  •  macOS 15+";
"help.developer" = "Developer: ModelPC";

"help.cpu.title" = "CPU Usage";
"help.cpu.desc" = "Shows real-time and historical processor usage. The CPU graph tracks the last 30 readings. Turns red above 80% and blinks as an alert. On multi-core processors, enable per-core usage via Settings > Appearance > 'Show Core Usage'.";

"help.ram.title" = "Memory (RAM) Usage";
"help.ram.desc" = "The sum of active, inactive, and wired pages is calculated as used memory and displayed as a percentage. The blue progress bar shows the current status.";

"help.disk.title" = "Disk Usage";
"help.disk.desc" = "Shows the total capacity and used space of your main disk (/) as a percentage. You can hide the Disk card via Settings > Appearance > 'Show Disk Card'.";

"help.network.title" = "Network Usage";
"help.network.desc" = "Shows the total download + upload speed across all network interfaces in KB/s. The graph visualises the last 30 readings on a dynamic scale. Hide it via Settings > Appearance > 'Show Network Card'.";

"help.temp.title" = "Temperature Status";
"help.temp.desc" = "System thermal level is read via the macOS ThermalState API: Normal 🌡, Warm, Hot 🔥, and Critical 🚨. Exact degree values are not exposed to third-party apps by Apple.";

"help.settings.title" = "Settings & Customisation";
"help.settings.desc" = "Open Settings from the menu bar icon. Use the Appearance tab to toggle cards on/off. Choose Light / Dark / Auto theme in the Advanced tab. Adjust the refresh rate between 0.5 and 5 seconds. Energy Saving Mode reduces update frequency when inactive.";

"help.menubar.title" = "Menu Bar & Window Mode";
"help.menubar.desc" = "The app runs in the menu bar by default. Enable the standalone window via Settings > Appearance > 'Show as a Window'. The menu bar label shows the live CPU percentage and a mini graph.";

"contact.title" = "Contact";
"contact.subtitle" = "Reach out to the developer or follow on social media";
"contact.email.title" = "Send Email";
"contact.email.address" = "Official Support (info@modelpc.com)";
"contact.email.address2" = "Developer (modelpc91@gmail.com)";
"contact.social.youtube" = "YouTube";
"contact.social.github" = "GitHub";
"contact.social.x" = "X (Twitter)";
"contact.social.instagram" = "Instagram";
"contact.social.website" = "Web Site";
"contact.social" = "Social Media";
"app.running_in_menu" = "The app is running in the menu bar";
"app.window_mode_hint" = "You can activate the window view from Menu Bar > Settings > Appearance tab.";

